mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Set binary data from the file store on SD card/Flash memory to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file data, StorageType::SPIFS or StorageType::SD.
    @param path - Target database path in which binary data from the file will be set.
    @param fileName - File name included its path in SD card/Flash memory

    @return - Boolean type status indicates the success of the operation.

    No payload returned from the server.

  */
  bool setFile(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName);

  bool set(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName);

  /*

    Set binary data from the file and virtual child ".priority" at the defined database path.

  */
  bool setFile(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, float priority);

  bool set(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, float priority);

  /*
    Set binary data from file stored on SD card/Flash memory to the defined database path if defined database path's ETag matched the ETag value.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file data, StorageType::SPIFS or StorageType::SD.
    @param path - Target database path in which binary data from the file will be set.
    @param fileName - File name included its path in SD card/Flash memory.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of the operation.
    
    No payload returned from the server.

    If ETag at the defined database path does not match the provided ETag parameter,
    the operation will fail with HTTP code 412, Precondition Failed (ETag is not matched).

   */
  bool setFile(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, const String &ETag);

  bool set(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, const String &ETag);

  /*

    Set binary data from the file and the virtual child ".priority" if defined ETag matches at the defined database path 

  */
  bool setFile(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, float priority, const String &ETag);

  bool set(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, float priority, const String &ETag);

  /*
    Set Firebase server's timestamp to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which timestamp will be set.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].intData will return the integer value of timestamp in seconds
    or [FirebaseData object].doubleData to get millisecond timestamp.

    Due to bugs in Serial.print in Arduino, to print large double value with zero decimal place, 
    use printf("%.0lf\n", firebaseData.doubleData());.

   */
  bool setTimestamp(FirebaseData &fbdo, const String &path);

  /*
    Update the child node key or existing key's value (using FirebaseJson object) under the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be updated.
    @param json - The FirebaseJson object used for the update.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database.

    Call [FirebaseData object].jsonData will return the json string value of
    payload returned from server.

    To reduce network data usage, use updateNodeSilent instead.

  */
  bool updateNode(FirebaseData &fbdo, const String path, FirebaseJson &json);

  /*

    Update child node key or existing key's value and virtual child ".priority" (using JSON data or FirebaseJson object) under the defined database path.

  */

  bool updateNode(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority);

  /*
    Update the child node key or existing key's value (using FirebaseJson object) under the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be updated.
    @param json - The FirebaseJson object used for the update.

    @return - Boolean type status indicates the success of the operation.

    Owing to the objective of this function to reduce network data usage,
    no payload will be returned from the server.

  */
  bool updateNodeSilent(FirebaseData &fbdo, const String &path, FirebaseJson &json);

  /*

    Update child node key or existing key's value and virtual child ".priority" (using JSON data or FirebaseJson object) under the defined database path.

  */

  bool updateNodeSilent(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority);

  /*
    Read any type of value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].intData, [FirebaseData object].floatData, [FirebaseData object].doubleData,
    [FirebaseData object].boolData, [FirebaseData object].stringData, [FirebaseData object].jsonObject (pointer), 
    [FirebaseData object].jsonArray (pointer) and [FirebaseData object].blobData corresponded to 
    its type from [FirebaseData object].dataType.

  */
  bool get(FirebaseData &fbdo, const String &path);

