mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Read the integer value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].intData will return the integer value of
    payload returned from server.

    If the type of payload returned from server is not integer, float and double, 
    the function [FirebaseData object].intData will return zero (0).

  */
  bool getInt(FirebaseData &fbdo, const String &path);

  /*
    Read the integer value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.
    @param target - The integer type variable to store value.

    @return - Boolean type status indicates the success of the operation.

    If the type of payload returned from the server is not an integer, float and double, 
    the target variable's value will be zero (0).

  */
  bool getInt(FirebaseData &fbdo, const String &path, int &target);

  /*
    Read the float value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].floatData will return the float value of
    payload returned from server.

    If the payload returned from server is not integer, float and double, 
    the function [FirebaseData object].floatData will return zero (0).

   */
  bool getFloat(FirebaseData &fbdo, const String &path);

  /*
    Read the float value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.
    @param target - The float type variable to store value.

    @return - Boolean type status indicates the success of the operation.


    If the type of payload returned from the server is not an integer, float and double, 
    the target variable's value will be zero (0).

   */
  bool getFloat(FirebaseData &fbdo, const String &path, float &target);

  /*
    Read the double value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].doubleData will return the double value of
    the payload returned from the server.

    If the payload returned from server is not integer, float and double, 
    the function [FirebaseData object].doubleData will return zero (0).

    Due to bugs in Serial.print in Arduino, to print large double value with zero decimal place, 
    use printf("%.9lf\n", firebaseData.doubleData()); for print value up to 9 decimal places.

   */
  bool getDouble(FirebaseData &fbdo, const String &path);

  /*
    Read the float value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.
    @param target - The double type variable to store value.

    @return - Boolean type status indicates the success of the operation.


    If the type of payload returned from the server is not an integer, float and double, 
    the target variable's value will be zero (0).

   */
  bool getDouble(FirebaseData &fbdo, const String &path, double &target);

  /*
    Read the Boolean value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the Boolean value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].boolData will return the Boolean value of
    the payload returned from the server.

    If the type of payload returned from the server is not Boolean, 
    the function [FirebaseData object].boolData will return false.

   */
  bool getBool(FirebaseData &fbdo, const String &path);

  /*
    Read the Boolean value at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the Boolean value is being read.
    @param target - The boolean type variable to store value.

    @return - Boolean type status indicates the success of the operation.


    If the type of payload returned from the server is not Boolean, 
    the target variable's value will be false.

   */
  bool getBool(FirebaseData &fbdo, const String &path, bool &target);

  /*
    Read the string at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the string value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in the database.

    Call [FirebaseData object].stringData will return the string value of
    the payload returned from the server.

    If the type of payload returned from the server is not a string,
    the function [FirebaseData object].stringData will return empty string (String object).

  */
  bool getString(FirebaseData &fbdo, const String &path);

  /*
    Read the string at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the string value is being read.
    @param target - The String object to store value.

    @return - Boolean type status indicates the success of the operation.

