mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
    If the type of payload returned from the server is not a string,
    the target String object's value will be empty.

  */
  bool getString(FirebaseData &fbdo, const String &path, String &target);

  /*
    Read the JSON string at the defined database path.
    The returned payload JSON string represents the child nodes and their value.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the JSON string value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in the database.

    Call [FirebaseData object].jsonObject will return the pointer to FirebaseJson object contains the value of
    the payload returned from the server.

    If the type of payload returned from server is not json,
    the function [FirebaseData object].jsonObject will contain empty object.

  */
  bool getJSON(FirebaseData &fbdo, const String &path);

  /*
    Read the JSON string at the defined database path.
    The returned the pointer to FirebaseJson that contains JSON payload represents the child nodes and their value.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the JSON string value is being read.
    @param target - The FirebaseJson object pointer to get JSON data.

    @return - Boolean type status indicates the success of the operation.

    If the type of payload returned from the server is not JSON,
    the target FirebaseJson object will contain an empty object.


  */
  bool getJSON(FirebaseData &fbdo, const String &path, FirebaseJson *target);

  /*
    Read the JSON string at the defined database path.
    The returned the pointer to FirebaseJson that contains JSON payload represents the child nodes and their value.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the JSON string value is being read.
    @param query - QueryFilter class to set query parameters to filter data.

    @return - Boolean type status indicates the success of the operation.

    Available query parameters for filtering the data are the following.

    QueryFilter.orderBy -       Required parameter to specify which data used for data filtering included child key, key, and value.
                                Use "$key" for filtering data by keys of all nodes at the defined database path.
                                Use "$value" for filtering data by value of all nodes at the defined database path.
                                Use "$priority" for filtering data by "virtual child" named .priority of all nodes.
                                Use any child key to filter by that key.


    QueryFilter.limitToFirst -  The total children (number) to filter from the first child.
    QueryFilter.limitToLast -   The total last children (number) to filter.
    QueryFilter.startAt -       Starting value of range (number or string) of query upon orderBy param.
    QueryFilter.endAt -         Ending value of range (number or string) of query upon orderBy param.
    QueryFilter.equalTo -       Value (number or string) matches the orderBy param


    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database.

    Call [FirebaseData object].jsonObject will return the pointer to FirebaseJson object contains the value of
    the payload returned from the server.

    If the type of payload returned from server is not json,
    the function [FirebaseData object].jsonObject will contain empty object.


  */
  bool getJSON(FirebaseData &fbdo, const String &path, QueryFilter &query);

  /*
     Read the JSON string at the defined database path as above

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the JSON string value is being read.
    @param target - The FirebaseJson object pointer to get JSON data.

    @return - Boolean type status indicates the success of the operation.

    If the type of payload returned from the server is not JSON,
    the target FirebaseJson object will contain an empty object.

  */
  bool getJSON(FirebaseData &fbdo, const String &path, QueryFilter &query, FirebaseJson *target);

  /*
    Read the array data at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the array is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in the database.

    Call [FirebaseData object].jsonArray will return the pointer to FirebaseJsonArray object contains array value of
    payload returned from server.

    If the type of payload returned from the server is not an array,
    the array element in [FirebaseData object].jsonArray will be empty.

  */
  bool getArray(FirebaseData &fbdo, const String &path);

  /*
    Read the array data at the defined database path, and assign data to the target.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the array is being read.
    @param target - The FirebaseJsonArray object pointer to get array value.

    @return - Boolean type status indicates the success of the operation.

    If the type of payload returned from the server is not an array,
    the target FirebaseJsonArray object will contain an empty array.

  */
  bool getArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray *target);

  /*
    Read the array data at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path in which the array is being read.
    @param query - QueryFilter class to set query parameters to filter data.

    @return - Boolean type status indicates the success of the operation.

