mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
private:
  callback_function_t _callback_function = nullptr;

  bool pushInt(FirebaseData &fbdo, const std::string &path, int intValue, bool queue, const std::string &priority);
  bool pushFloat(FirebaseData &fbdo, const std::string &path, float floatValue, bool queue, const std::string &priority);
  bool pushDouble(FirebaseData &fbdo, const std::string &path, double doubleValue, bool queue, const std::string &priority);
  bool pushBool(FirebaseData &fbdo, const std::string &path, bool boolValue, bool queue, const std::string &priority);
  bool pushBlob(FirebaseData &fbdo, const std::string &path, uint8_t *blob, size_t size, bool queue, const std::string &priority);
  bool setInt(FirebaseData &fbdo, const std::string &path, int intValue, bool queue, const std::string &priority, const std::string &etag);
  bool setFloat(FirebaseData &fbdo, const std::string &path, float floatValue, bool queue, const std::string &priority, const std::string &etag);
  bool setDouble(FirebaseData &fbdo, const std::string &path, double doubleValue, bool queue, const std::string &priority, const std::string &etag);
  bool setBool(FirebaseData &fbdo, const std::string &path, bool boolValue, bool queue, const std::string &priority, const std::string &etag);
  bool setBlob(FirebaseData &fbdo, const std::string &path, uint8_t *blob, size_t size, bool queue, const std::string &priority, const std::string &etag);

  void getUrlInfo(const std::string url, std::string &host, std::string &uri, std::string &auth);
  bool processRequest(FirebaseData &fbdo, fb_esp_method method, fb_esp_data_type dataType, const std::string &path, const char *buff, bool queue, const std::string &priority, const std::string &etag = "");
  bool processRequestFile(FirebaseData &fbdo, uint8_t storageType, fb_esp_method method, const std::string &path, const std::string &fileName, bool queue, const std::string &priority, const std::string &etag = "");
  bool handleRequest(FirebaseData &fbdo, uint8_t storageType, const std::string &path, fb_esp_method method, fb_esp_data_type dataType, const std::string &payload, const std::string &priority, const std::string &etag);
  bool handleStreamRequest(FirebaseData &fbdo, const std::string &path);
  bool handleStreamRead(FirebaseData &fbdo);
  void parseRespHeader(const char *buf, server_response_data_t &response);
  void parseRespPayload(const char *buf, server_response_data_t &response, bool getOfs);
  void setNumDataType(const char *buf, int ofs, server_response_data_t &response, bool dec);
  char *getHeader(const char *buf, PGM_P beginH, PGM_P endH, int &beginPos, int endPos);
  bool stringCompare(const char *buf, int ofs, PGM_P beginH);
  int readLine(WiFiClient *stream, char *buf, int bufLen);
  int readChunkedData(WiFiClient *stream, char *out, int &chunkState, int &chunkedSize, int &dataLen, int bufLen);
  bool waitResponse(FirebaseData &fbdo);
  void checkOvf(FirebaseData &fbdo, size_t len, server_response_data_t &resp);
  bool handleResponse(FirebaseData &fbdo);
  void closeFileHandle(FirebaseData &fbdo);
  void handlePayload(FirebaseData &fbdo, server_response_data_t &response, char *payload);
  bool reconnect(FirebaseData &fbdo, unsigned long dataTime = 0);
  void delS(char *p);
  char *newS(size_t len);
  char *newS(char *p, size_t len);
  char *newS(char *p, size_t len, char *d);

  void runStreamTask();
  void runErrorQueueTask();

  void preparePayload(fb_esp_method method, fb_esp_data_type dataType, const std::string &priority, const std::string &payload, std::string &buf);
  void prepareHeader(FirebaseData &fbdo, const std::string &host, fb_esp_method method, fb_esp_data_type dataType, const std::string &path, const std::string &auth, int payloadLength, std::string &header, bool sv);
  void clearDataStatus(FirebaseData &fbdo);
  void closeHTTP(FirebaseData &fbdo);
  int sendRequest(FirebaseData &fbdo, const std::string &path, fb_esp_method method, fb_esp_data_type dataType, const std::string &payload, const std::string &priority);
  void setSecure(FirebaseData &fbdo);
  bool connectionError(FirebaseData &fbdo);
  uint8_t openErrorQueue(FirebaseData &fbdo, const String &filename, uint8_t storageType, uint8_t mode);
  std::vector<std::string> splitString(int size, const char *str, const char delim);

  char *getPGMString(PGM_P pgm);
  char *getFloatString(float value);
  char *getDoubleString(double value);
  char *getIntString(int value);
  char *getBoolString(bool value);
  void pgm_appendStr(std::string &buf, PGM_P p, bool empty = false);
  void trimDigits(char *buf);
  void strcat_c(char *str, char c);
  int strpos(const char *haystack, const char *needle, int offset);
  char *rstrstr(const char *haystack, const char *needle);
  int rstrpos(const char *haystack, const char *needle, int offset);
  bool sdTest();
  void createDirs(std::string dirs, uint8_t storageType);
  bool replace(std::string &str, const std::string &from, const std::string &to);
  std::string base64_encode_string(const unsigned char *src, size_t len);
  void send_base64_encoded_stream(WiFiClient *client, const std::string &filePath, uint8_t storageType);
  bool base64_decode_string(const std::string src, std::vector<uint8_t> &out);
  bool base64_decode_file(File &file, const char *src, size_t len);
  bool base64_decode_flash(fs::File &file, const char *src, size_t len);
  uint32_t hex2int(const char *hex);

  bool handleFCMRequest(FirebaseData &fbdo, fb_esp_fcm_msg_type messageType);
  void setClock(float offset);

  void set_scheduled_callback(callback_function_t callback)
  {
    _callback_function = std::move([callback]() { schedule_function(callback); });
    _callback_function();
  }

  std::string _host = "";
  std::string _auth = "";
  std::shared_ptr<const char> _caCert = nullptr;
  int _certType = -1;
  std::string _caCertFile = "";
  uint8_t _caCertFileStoreageType = StorageType::FLASH;

  uint16_t _port = FIREBASE_PORT;
  uint8_t _sdPin = SD_CS_PIN;
  bool _reconnectWiFi = false;
  bool _sdOk = false;
  bool _sdInUse = false;
  bool _clockReady = false;
  unsigned long _lastReconnectMillis = 0;
  uint16_t _reconnectTimeout = WIFI_RECONNECT_TIMEOUT;
  File file;
  fs::File _file;
  float _gmtOffset = 0.0;
  uint8_t _floatDigits = 5;
  uint8_t _doubleDigits = 9;
};

class FirebaseData
{

