mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Determine the matching between data type that intends to get from/store to database and the server's return payload data type.

    @return Boolean type status indicates whether the type of data being get from/store to database 
    and the server's returned payload is matched or not.

   */
  bool mismatchDataType();

  /*
    Determine the HTTP status code return from the server.

    @return integer number of HTTP status.

   */
  int httpCode();

  /*

    Check the overflow of the returned payload data buffer.

    @return The overflow status.

    Total default HTTP response buffer size is 400 bytes which can be set through FirebaseData.setResponseSize.

  */
  bool bufferOverflow();

  /*
    Determine the name (full path) of the backup file in SD card/Flash memory.
    
    @return String (String object) of the file name that stores on SD card/Flash memory after backup operation.

   */
  String getBackupFilename();

  /*
    Determine the size of the backup file.
    
    @return Size of backup file in byte after backup operation.

   */
  size_t getBackupFileSize();

  /*
    Clear or empty data in Firebase Data object.

   */
  void clear();

  /*
    Determine the error description for file transferring (push file, set file, backup and restore).
    
    @return Error description string (String object).

   */
  String fileTransferError();

  /*
    Return the server's payload data.
    
    @return Payload string (String object).

    The returned String will be empty when the response data is File, BLOB, JSON and JSON Array objects.

    For File data type, call fileStream to get the file stream.

    For BLOB data type, call blobData to get the dynamic array of unsigned 8-bit data.

    For JSON object data type, call jsonObject and jsonObjectPtr to get the object and its pointer.

    For JSON Array data type, call jsonArray and jsonArrayPtr to get the object and its pointer.

   */
  String payload();

  FCMObject fcm;

  FirebaseESP8266HTTPClient httpClient;

  QueryFilter queryFilter;

private:
  FirebaseESP8266::StreamEventCallback _dataAvailableCallback = NULL;
  FirebaseESP8266::MultiPathStreamEventCallback _multiPathDataCallback = NULL;
  FirebaseESP8266::StreamTimeoutCallback _timeoutCallback = NULL;
  FirebaseESP8266::QueueInfoCallback _queueInfoCallback = NULL;

  int _QIdx = -1;
  int _idx = -1;
  uint8_t _dataTypeNum = 0;

  bool _isDataTimeout = false;
  bool _isStream = false;
  bool _isFCM = false;
  bool _isRTDB = false;
  bool _streamStop = false;
  bool _reqNoContent = false;

  bool _bufOvf = false;
  bool _streamDataChanged = false;
  bool _streamPathChanged = false;
  bool _dataAvailable = false;
  bool _keepAlive = false;
  bool _isChunkedEnc = false;
  bool _httpConnected = false;
  bool _mismatchDataType = false;
  bool _pathNotExist = false;
  bool _pause = false;
  bool _classicRequest = false;
  fb_esp_data_type resp_dataType = fb_esp_data_type::d_any;
  uint8_t _connectionStatus = 0;
  uint32_t _qID = 0;
  QueueManager _qMan;
  uint8_t _maxAttempt = 0;

  fb_esp_method _req_method = fb_esp_method::m_put;
  fb_esp_data_type _req_dataType = fb_esp_data_type::d_any;

  std::string _path = "";
  std::string _data = "";
  std::string _data2 = "";
  std::string _streamPath = "";
  std::string _pushName = "";
  std::string _file_transfer_error = "";
  std::string _fileName = "";
  std::string _redirectURL = "";
  std::string _fbError = "";
  std::string _eventType = "";
  std::string _resp_etag = "";
  std::string _req_etag = "";
  std::string _priority = "";
  uint8_t _storageType = 0;
  uint8_t _redirectCount = 0;
  int _redirect = 0;
  FirebaseJson _json;
  FirebaseJsonArray _jsonArr;
  FirebaseJsonData _jsonData;

  uint16_t _maxBlobSize = MAX_BLOB_PAYLOAD_SIZE;
  uint16_t _bsslRxSize = 512;
  uint16_t _bsslTxSize = 512;
  uint16_t _responseBufSize = 1024;

  unsigned long _streamTimeoutMillis = 0;
  unsigned long _streamReconnectMillis = 0;

  std::vector<uint8_t> _blob = std::vector<uint8_t>();
  std::vector<std::string> _childNodeList = std::vector<std::string>();

  int _httpCode = -1000;
  int _contentLength = 0;

  bool _priority_val_flag = false;
  bool _priority_json_flag = false;
  bool _shallow_flag = false;
  int _readTimeout = -1;
  std::string _writeLimit = "";

  unsigned long _dataMillis = 0;
  std::string _backupNodePath = "";
  std::string _backupDir = "";
  std::string _backupFilename = "";
  size_t _backupzFileSize = 0;

  bool handleStreamRead();
  bool handleResponse();
  std::string getDataType(uint8_t type);
  std::string getMethod(uint8_t method);

  void addQueue(fb_esp_method method,
                uint8_t storageType,
                fb_esp_data_type dataType,
                const std::string path,
                const std::string filename,
                const std::string payload,
                bool isQuery,
                int *intTarget,
                float *floatTarget,
                double *doubleTarget,
                bool *boolTarget,
                String *stringTarget,
                std::vector<uint8_t> *blobTarget,
                FirebaseJson *jsonTarget,
                FirebaseJsonArray *arrTarget);

  void clearQueueItem(QueueItem &item);

  void setQuery(QueryFilter &query);

  void clearNodeList();

  void addNodeList(const String *childPath, size_t size);

  friend class FirebaseESP8266;
  friend class QueueManager;
  friend class StreamData;
  friend class FCMObject;
};

class StreamData
{
public:
  StreamData();
  ~StreamData();
  String dataPath();
  String streamPath();
  int intData();
  float floatData();
  double doubleData();
  bool boolData();
  String stringData();
  String jsonString();
  FirebaseJson *jsonObjectPtr();
  FirebaseJson &jsonObject();
  FirebaseJsonArray *jsonArrayPtr();
  FirebaseJsonArray &jsonArray();
  FirebaseJsonData *jsonDataPtr();
  FirebaseJsonData &jsonData();
  std::vector<uint8_t> blobData();
  File fileStream();
  String dataType();
  String eventType();
  void empty();

  FirebaseJson *_json = nullptr;
  FirebaseJsonArray *_jsonArr = nullptr;
  FirebaseJsonData *_jsonData = nullptr;

private:
  std::string _streamPath = "";
  std::string _path = "";
  std::string _data = "";
  std::vector<uint8_t> _blob = std::vector<uint8_t>();
  std::string _dataTypeStr = "";
  std::string _eventTypeStr = "";
  uint8_t _dataType = 0;
  int _idx = -1;

  friend class FirebaseESP8266;
};

class MultiPathStreamData
{
  friend class FirebaseESP8266;

public:
  MultiPathStreamData();
  ~MultiPathStreamData();
  bool get(const String &path);
  String dataPath;
  String value;
  String type;

private:
  uint8_t _type = 0;
  std::string _data = "";
  std::string _path = "";
  std::string _typeStr = "";
  FirebaseJson *_json = nullptr;

  void empty();
};

extern FirebaseESP8266 Firebase;

#endif /* ESP8266 */

#endif /* FirebaseESP8266_H */